# 2 :21 ftp

```
$ ftp 192.168.99.114
Connected to 192.168.99.114.
220 (vsFTPd 3.0.3)
Name (192.168.99.114:kashz): anonymous
331 Please specify the password.
Password:
230 Login successful.
Remote system type is UNIX.
Using binary mode to transfer files.

ftp> dir
200 PORT command successful. Consider using PASV.
150 Here comes the directory listing.
drwxr-xr-x   14 14       11           4096 Nov 06  2020 forum
226 Directory send OK.

ftp> cd forum
250 Directory successfully changed.
ftp> dir
200 PORT command successful. Consider using PASV.
150 Here comes the directory listing.
-rw-r--r--    1 0        0            1965 Nov 06  2020 Gemfile
-rw-r--r--    1 0        0            5512 Nov 06  2020 Gemfile.lock
-rw-r--r--    1 0        0             374 Nov 06  2020 README.md
-rw-r--r--    1 0        0             227 Nov 06  2020 Rakefile
drwxr-xr-x   11 0        0            4096 Nov 06  2020 app
drwxr-xr-x    2 0        0            4096 Nov 06  2020 bin
drwxr-xr-x    5 0        0            4096 Nov 06  2020 config
-rw-r--r--    1 0        0             130 Nov 06  2020 config.ru
drwxr-xr-x    2 0        0            4096 Nov 06  2020 db
drwxr-xr-x    4 0        0            4096 Nov 06  2020 lib
drwxr-xr-x    2 0        0            4096 Nov 06  2020 log
-rw-r--r--    1 0        0             217 Nov 06  2020 package.json
drwxr-xr-x    2 0        0            4096 Nov 06  2020 public
drwxr-xr-x    2 0        0            4096 Nov 06  2020 storage
drwxr-xr-x   10 0        0            4096 Nov 06  2020 test
drwxr-xr-x    5 0        0            4096 Nov 06  2020 tmp
drwxr-xr-x    2 0        0            4096 Nov 06  2020 vendor
226 Directory send OK.

# download all files locally to explore easily
wget -r ftp://192.168.99.114/
Downloaded: 99 files, 209K in 0.4s (465 KB/s)

# its a rails app

$ cat 192.168.99.114/forum/config/credentials.yml.enc
1K+mGystCWHMhDoWnvUC1/EGwsufZQMK38+vqlB7tOR6+Ye5JydxFOecdoeYld3lUc2z5u3Ru7MdwXx483FYFBvjPZKELCFmrx/VH5ztLntTo4WWdX6SKBLaQhjw68yF6znjMV07FHh0lvIxPlTw0L+n7kBxmMX3JZvIqp9QFN+Nmpuu45oPoa2RgIxv2nuXWDkS6zyw1v5WN51c6xkGdshuPlHIjIDVSlRYJKa+Rp1RHNS5HBHa99lQcmpfCRS0flnknDgWcuH6rJBaFH293lMH32+iKYjo5Kg+uSaPesOXdEtxCF+sRBxiQbuaKmTczjze2/5Cy691ROKPhXTD7t6TGelr/EZeu1K/A82CeXXFuvbXLWpSCulmp2Y+3p+PiBvc6rFwzrWZJ1lW9SHk/0B00r3FS/ucgyQT--ID6HcaDNs7ONKqNK--slJM1tGXmXiwwRBc3at1JQ==

# master.key exsits but cannot read it
ftp> ls -la
200 PORT command successful. Consider using PASV.
150 Here comes the directory listing.
drwxr-xr-x    5 0        0            4096 Nov 06  2020 .
drwxr-xr-x   14 14       11           4096 Nov 06  2020 ..
-rw-r--r--    1 0        0             656 Nov 06  2020 application.rb
-rw-r--r--    1 0        0             207 Nov 06  2020 boot.rb
-rw-r--r--    1 0        0             186 Nov 06  2020 cable.yml
-rw-r--r--    1 0        0             464 Nov 06  2020 credentials.yml.enc
-rw-r--r--    1 0        0             620 Nov 06  2020 database.yml
-rw-r--r--    1 0        0             128 Nov 06  2020 environment.rb
drwxr-xr-x    2 0        0            4096 Nov 06  2020 environments
drwxr-xr-x    2 0        0            4096 Nov 06  2020 initializers
drwxr-xr-x    2 0        0            4096 Nov 06  2020 locales
-rw-------    1 0        0              32 Nov 06  2020 master.key
-rw-r--r--    1 0        0            1585 Nov 06  2020 puma.rb
-rw-r--r--    1 0        0             140 Nov 06  2020 routes.rb
-rw-r--r--    1 0        0              97 Nov 06  2020 spring.rb
-rw-r--r--    1 0        0            1093 Nov 06  2020 storage.yml
226 Directory send OK.


# Gemfile contains
ruby '2.7.2'
gem 'rails', '~> 6.0.3', '>= 6.0.3.4'
```
